Revit 2024 API
PointCloudOverrides.GetPointCloudScanOverrideSettings Method
Overload List
Name | Description
GetPointCloudScanOverrideSettings(ElementId)
 Gets scan override settings assigned to the whole PointCloudInstance element.
GetPointCloudScanOverrideSettings(ElementId, String, Document)
 Gets override settings assigned to a particular scan within a PointCloudInstance element.
See Also
PointCloudOverrides Class
PointCloudOverrides Members
Autodesk.Revit.DB.PointClouds Namespace